/**
 * @file gimbal_behaviour.c
 * @brief 云台控制任务
 * ----------------------------------------------------------------------------
 * 云台的行为控制模块，实现云台的各种控制功能，提供云台行为的接口函数
 *
 */


/*-----------------------------------头文件引用-----------------------------------*/

#include "gimbal_behaviour.h"
#include "bsp_buzzer_pwm.h"
#include "string.h"
#include "bsp_servo_pwm.h"

/*-----------------------------------宏定义-----------------------------------*/

// 云台校准时，设置蜂鸣器频率和强度
#define gimbal_warn_buzzer_on() Buzzer_Control(2000, 50)
#define gimbal_warn_buzzer_off() Buzzer_Control(0, 0)
#define int_abs(x) ((x) > 0 ? (x) : (-x))

/*-----------------------------------变量声明-----------------------------------*/






/*-----------------------------------函数实现-----------------------------------*/




